Простой RSS reader 

При добавлении ленты (например https://habrahabr.ru/rss/interesting/) 
записи из добавленной ленты сканируются и заносятся в базу (например sqlite)

При нажатии на кнопку обновить - новое сканирование и добавление новых записей (без дублрования существующих)

Отображение ленты начиная с самых свежих записей с пагинацией (несколько записей на странице)

Записи из разных лент хранить и показывать отдельно (по названию ленты).

сделать серверную часть, т.е. клиент работает в обычном браузере обращаясь к веб-серверу.


Продублировать отчет (исходник) на xms@npp-itb.spb.ru